Autodesk.Revit.DB.FillPattern.IsEqual(Autodesk.Revit.DB.FillPattern)
Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
other:
The fill pattern to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL